
package jp.tomorrowkey.checkoutorderimporter.entity;

/**
 * 国コード
 */
public enum CountryCode {
    US, // アメリカ
    JP, // 日本
    IL, // イスラエル
    IN, // インド
    KR, // 韓国
    AU, // オーストラリア
    ZA, // 南アフリカ
    GB, // イギリス
    IT, // イタリア
    NL, // オランダ
    BR, // ブラジル
    FI, // フィンランド
    CL, // チリ
    ES, // スペイン
    MY, // マレーシア
    CA, // カナダ
    NZ, // ニュージーランド
    PH, // フィリピン
    RU, // ロシア
    SA, // サウジアラビア
    AT, // オーストリア
    QA, // カタール
    GR, // ギリシャ
    TH, // タイ
    BE, // ベルギー
    CH, // スイス
    HK, // 香港
    AL, // アルバニア
    SE, // スウェーデン
    DK, // デンマーク
    SG, // シンガポール
    NO, // ノルウェー
    TW, // 台湾
    PT, // ポルトガル
    HU, // ハンガリー
    FR, // フランス
    DE, // ドイツ
    SK, // スロバキア
    CZ, // チェコ
    ID, // インドネシア
    PL, // ポーランド
    LU, // ルクセンブルク
    RO, // ルーマニア
    LT, // リトアニア
    KW, // クウェート
    IE, // アイルランド
    AE, // アラブ
    PA, // パナマ
    AR, // アルゼンチン
    MX, // メキシコ
    VE, // ベネズエラ
    BG, // ブルガリア
    PE, // ペルー
    GT, // グアテマラ
    PR, // プエルトリコ
}
